{"index":{"_index":"books","_type":"_doc"}}
{"name": "Unlocking Android","resume": "Unlocking Android: A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout.","author": "W. Frank Ableson"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Android in Action, Second Edition","resume": "Android in Action, Second Edition is a comprehensive tutorial for Android developers. Taking you far beyond \"Hello Android,\" this fast-paced book puts you in the driver's seat as you learn important architectural concepts and implementation strategies. You'll master the SDK, build WebKit apps using HTML 5, and even learn to extend or replace Android's built-in features by building useful and intriguing examples. ","author": "W. Frank Ableson"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Zend Framework in Action","resume": "Zend Framework in Action is a comprehensive tutorial that shows how to use the Zend Framework to create web-based applications and web services. This book takes you on an over-the-shoulder tour of the components of the Zend Framework as you build a high quality, real-world web application.","author": "Rob Allen"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Flex on Java","resume": "   A beautifully written book that is a must have for every Java Developer.       Ashish Kulkarni, Technical Director, E-Business Software Solutions Ltd.","author": "Bernerd Allmon"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Griffon in Action","resume": "Griffon in Action is a comprehensive tutorial written for Java developers who want a more productive approach to UI development. In this book, you'll immediately dive into Griffon. After a Griffon orientation and a quick Groovy tutorial, you'll start building examples that explore Griffon's high productivity approach to Swing development. One of the troublesome parts of Swing development is the amount of Java code that is required to get a simple application off the ground.","author": "Andres Almiray"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "OSGi in Depth","resume": "Enterprise OSGi shows a Java developer how to develop to the OSGi Service Platform Enterprise specification, an emerging Java-based technology for developing modular enterprise applications. Enterprise OSGi addresses several shortcomings of existing enterprise platforms, such as allowing the creation of better maintainable and extensible applications, and provide a simpler, easier-to-use, light-weight solution to enterprise software development.","author": "Alexandre de Castro Alves"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Flexible Rails","resume": "\"Flexible Rails created a standard to which I hold other technical books. You definitely get your money's worth.\"","author": "Peter Armstrong"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Hello! Flex 4","resume": "Hello! Flex 4 progresses through 26 self-contained examples selected so you can progressively master Flex. They vary from small one-page apps, to a 3D rotating haiku, to a Connect Four-like game. And in the last chapter you'll learn to build a full Flex application called SocialStalkr   a mashup that lets you follow your friends by showing their tweets on a Yahoo map.","author": "Peter Armstrong"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Coffeehouse","resume": "Coffeehouse is an anthology of stories, poems and essays originally published on the World Wide Web.","author": "Levi Asher"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Brownfield Application Development in .NET","resume": "Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.","author": "Kyle Baley"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "MongoDB in Action","resume": "MongoDB In Action is a comprehensive guide to MongoDB for application developers. The book begins by explaining what makes MongoDB unique and describing its ideal use cases. A series of tutorials designed for MongoDB mastery then leads into detailed examples for leveraging MongoDB in e-commerce, social networking, analytics, and other common applications.","author": "Kyle Banker"}
{"index":{"_index":"books","_type":"_doc"}}
{"name": "Jaguar Development with PowerBuilder 7","resume": "Jaguar Development with PowerBuilder 7 is the definitive guide to distributed application development with PowerBuilder. It is the only book dedicated to preparing PowerBuilder developers for Jaguar applications and has been approved by Sybase engineers and product specialists who build the tools described in the book.","author": "Michael Barlotta"}
